using System;
using System.Collections.Generic;
using System.Linq;

namespace Y.ASIS.Common.Models.Enums
{

    public static class PLCFaultCodeExt
    {
        public static IEnumerable<int> IntValues { get; private set; } = Enum.GetValues(typeof(PLCFaultCode)).OfType<PLCFaultCode>().Select(e => (int)e);
    }

    /// <summary>
    /// PLC 故障编码
    /// </summary>
    public enum PLCFaultCode
    {
        Error = -1,
        操作终端警示按钮故障 = 1,
        操作终端合闸按钮故障,
        操作终端分闸按钮故障,
        操作终端验电按钮故障,
        操作终端撤验电按钮故障,
        操作终端接地按钮故障,
        操作终端撤接地按钮故障,

        隔离开关故障 = 021,
        验电装置故障或位置异常 = 022,
        接地装置故障或位置异常 = 023,
        门禁故障 = 024,
        门禁故障_未使能开启 = 025,

        隔离开关通信失败 = 101,
        隔离开关合闸位置失效,
        隔离开关分闸位置失效,
        隔离开关位置未知,
        隔离开关合闸执行失败,
        隔离开关分闸执行失败,
        隔离开关合闸输出故障,
        隔离开关分闸输出故障,
        隔离开关设备故障提示,
        隔离开关设备近控模式,
        隔离开关设备远控模式,

        验电装置通信失败 = 121,
        验电装置近控模式,
        验电装置验电超限,
        验电装置验电超时,
        验电装置验电输出故障,
        验电装置撤验电超时,
        验电装置撤验电输出故障,
        验电装置验电冲突故障1,
        验电装置验电冲突故障0,
        验电差值超限,

        验电装置上报错误状态 = 139,

        接地装置通信失败 = 141,
        接地装置近控模式,
        接地装置接地超限,
        接地装置接地超时,
        接地装置接地输出故障,
        接地装置撤接地超时,
        接地装置撤接地输出故障,
        接地装置验电冲突故障1,
        接地装置验电冲突故障0,

        接地异常 = 150,
        撤接地异常 = 151,
        直流电压变送器断线故障1 = 152,
        直流电压变送器断线故障2 = 153,
        接地装置机构故障 = 154,

        接地装置上报错误状态 = 159,

        一号显示器通信失败 = 161,
        二号显示器通信失败,
        三号显示器通信失败,
        四号显示器通信失败,
        五号显示器通信失败,
        六号显示器通信失败,
        七号显示器通信失败,
        八号显示器通信失败,
        九号显示器通信失败,
        十号显示器通信失败,

        回路电阻仪通信失败 = 181,

        信号机左侧入库信号机故障 = 201,
        信号机左侧出库信号机故障,
        信号机左侧移库信号机故障,
        信号机右侧入库信号机故障,
        信号机右侧出库信号机故障,
        信号机右侧移库信号机故障,

        道闸机1通信故障 = 221,

        道闸机1遇阻返回 = 226,
        道闸机1电机未接 = 227,
        道闸机1电流过大 = 228,
        道闸机1执行失败 = 229,

        道闸机2通信故障 = 231,

        门禁系统门一控制器通信失败 = 501,
        门禁系统门一锁故障,
        门禁系统门一控制器1读头1通信失败,
        门禁系统门一控制器1读头2通信失败,
        门禁系统门一客流计通信失败,
        门禁系统门一尾随报警,
        门禁验证后开启失败,

        门禁系统门二尾随报警 = 526,

        //严重异常
        门锁异常开启错误 = 995,
        门禁状态错误或不匹配 = 996,
        接地装置状态错误或不匹配,
        验电装置状态错误或不匹配,
        隔离开关状态错误,
    }
}
